Revit 2027 API
DirectContext3DHandleSettings.SetVisibility Method
 Visibility of the handle and the associated DirectContext3D graphics. A value of true means that the graphics are visible.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetVisibility(
	bool visibility
)
Public Sub SetVisibility (
	visibility As Boolean
)
public:
void SetVisibility(
	bool visibility
)
member SetVisibility :
        visibility : bool -> unit
Parameters
visibility Boolean
 Visibility of the handle and the associated DirectContext3D graphics. A value of true means that the graphics are visible.
See Also
Reference
DirectContext3DHandleSettings Class
Autodesk.Revit.DB.DirectContext3D Namespace